[
{ "Title": "Trump signs tax bill before leaving for Mar-a-Lago - CNNPolitics", "Description": "President Donald Trump will sign the Republican tax cut bill Friday morning before departing for his Christmas break in Florida.", "Keywords": "politics, Trump signs tax bill before leaving for Mar-a-Lago - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/22/politics/trump-sign-tax-bill-mar-a-lago/index.html"},
{ "Title": "The fine print of Trump's tax talking points - CNNPolitics", "Description": "For the first time since he took office a little more than 11 months ago, President Trump has signed into law sweeping new legislation -- a wide-ranging tax cut that will fundamentally remake the US tax code.", "Keywords": "politics, The fine print of Trump's tax talking points - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/22/politics/trump-tax-plan-talking-points/index.html"},
{ "Title": "Trump makes holiday visit to Walter Reed - CNNPolitics", "Description": "President Donald Trump was paying a holiday visit to wounded troops receiving medical care at a hospital outside Washington on Thursday", "Keywords": "politics, Trump makes holiday visit to Walter Reed - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/21/politics/trump-walter-reed/index.html"},
{ "Title": "Trump visited his properties over 100 times this year - CNNPolitics", "Description": "President Donald Trump, fresh off of signing his signature tax legislation, is in Florida for a  prolonged visit at Mar-A-Lago", "Keywords": "politics, Trump visited his properties over 100 times this year - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/22/politics/trump-mar-a-lago-golf/index.html"},
{ "Title": "Trump 'fired up' about humanitarian crisis in Yemen - CNNPolitics", "Description": "President Donald Trump has become increasingly concerned about the humanitarian crisis in Yemen, which has been made worse by years of fighting between Houthi rebels and the Saudi-led international coalition, a United Kingdom official tells CNN.", "Keywords": "politics, Trump 'fired up' about humanitarian crisis in Yemen - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/20/politics/trump-yemen-humanitarian-crisis/index.html"},
{ "Title": "Most Americans doubt Trump on Russia probe - CNNPolitics", "Description": "More Americans say they approve of how special counsel Robert Mueller is handling the investigation into Russian interference in the 2016 election than say they disapprove, a new CNN poll conducted by SSRS has found, while most Americans say President Donald Trump's public statements on the probe have not been truthful.", "Keywords": "politics, Most Americans doubt Trump on Russia probe - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/21/politics/trump-mueller-russia-poll/index.html"},
{ "Title": "Did Trump stop the 'war on Christmas'? Some say yes - CNNPolitics", "Description": "Did President Donald Trump live up to his promise to end the ”war on Christmas”? Depends on who you ask.", "Keywords": "politics, Did Trump stop the 'war on Christmas'? Some say yes - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/22/politics/donald-trump-war-on-christmas/index.html"},
{ "Title": "Trump is eager for 2018 campaigning, but are Republicans eager for him? - CNNPolitics", "Description": "Donald Trump, keen to fill the halls of Congress with his acolytes while defending his record as President, is already fully involved in his administration's political efforts ahead of the 2018 midterms, senior White House officials tell CNN.", "Keywords": "politics, Trump is eager for 2018 campaigning, but are Republicans eager for him? - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/21/politics/trump-2018-campaigning-republicans/index.html"},
{ "Title": "Trump issues first commutation - CNNPolitics", "Description": "President Donald Trump commuted the sentence of a man eight years into a 27-year term for bank fraud, the White House said Wednesday afternoon.", "Keywords": "politics, Trump issues first commutation - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/20/politics/donald-trump-commutes-sholom-rubashkin/index.html"},
{ "Title": "Trump on Alabama: 'I was right' Moore wouldn't be able to win - CNNPolitics", "Description": "President Donald Trump went back to Twitter Wednesday morning following Alabama's election stunner, claiming that he didn't endorse Republican candidate Roy Moore in the primary election because Trump knew Moore wouldn't be ”able to win.” ", "Keywords": "politics, Trump on Alabama: 'I was right' Moore wouldn't be able to win - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/13/_politics-zone-injection/trump-tweet-alabama/index.html"},
{ "Title": "Donald Trump tries to minimize stinging defeat in Alabama - CNNPolitics", "Description": "President Donald Trump is waking to a self-inflicted political disaster after Republican Roy Moore crashed to defeat in the Alabama Senate race.", "Keywords": "politics, Donald Trump tries to minimize stinging defeat in Alabama - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/13/politics/donald-trump-senate-race/index.html"},
{ "Title": "USA Today editorial board bashes Trump - CNNPolitics", "Description": "USA Today isn't known for its blistering opinion pieces. Which makes the one the paper's editorial board just published on President Donald Trump all the more savage.", "Keywords": "politics, USA Today editorial board bashes Trump - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/12/politics/usa-today-editorial-analysis/index.html"},
{ "Title": "Trump team push undercut by NY attack facts, critics say - CNNPolitics", "Description": "As the Trump administration presses the notion that recent terrorist attacks justify significant changes in the legal immigration system, critics say the facts of those attacks undercut their own argument. ", "Keywords": "politics, Trump team push undercut by NY attack facts, critics say - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/12/politics/new-york-attacker-domestic-radicalization-trump-administration/index.html"},
{ "Title": "Donald Trump woke up this morning and Alabama is still not his fault - CNNPolitics", "Description": "Less than 12 hours removed from a searing loss in Alabama's Senate race, President Donald Trump woke up Wednesday morning with a simple message: I was right.", "Keywords": "politics, Donald Trump woke up this morning and Alabama is still not his fault - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/13/politics/donald-trump-alabama-tweet-analysis/index.html"},
{ "Title": "Gillibrand on Trump's tweet: It was a 'sexist smear' - CNNPolitics", "Description": "Democratic Sen. Kirsten Gillibrand reiterated her belief that President Donald Trump's tweet on Tuesday about her was a ”sexist smear” in an interview Wednesday.", "Keywords": "politics, Gillibrand on Trump's tweet: It was a 'sexist smear' - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/13/politics/kirsten-gillibrand-donald-trump-tweet/index.html"},
{ "Title": "By the numbers: The Trump orbit's contacts with Russians - CNNPolitics", "Description": "Here is a look, by the numbers, at all the known contacts between Trump associates and Russians. From meetings to emails, to text messages and Skype sessions, these lists have been growing throughout the year as more details drip out in the investigations into Russian meddling in the 2016 US elections.", "Keywords": "politics, By the numbers: The Trump orbit's contacts with Russians - CNNPolitics", "URL": "http://edition.cnn.com/2017/11/21/politics/trump-russia-by-the-numbers/index.html"},
{ "Title": "The many paths from Trump to Russia", "Description": "Special Counsel Robert Mueller and committees in both chambers of Congress are investigating Russian meddling in the 2016 election and whether there were any links or coordination between the Trump orbit and the Russian government. Here is a summary of known connections between Trump associates and Russia.", "Keywords": "Trump and Russia: Known ties, Trump and Russia: Known connections, Trump and Russia: Connections, Trump and Russia: Putin, Trump and Russia: Election, Trump and Russia: infographic, Trump Russia Infographic, Trump and Russia: CNN, Trump and Russia: Hacking, Trump Russia Putin, Trump Russia graphic, Trump Russia Paul Manafort, Trump and Russia: Michael Flynn, Trump and Russia: Carter Page, Trump and Russia: Roger Stone, Trump and Russia: Jeff Sessions,  Trump and Russia: JD Gordon, Trump and Russia: Jared Kushner, Trump and Russia: Donald Trump Jr., Trump and Russia: Michael Cohen, Trump and Russia: Erik Prince, Trump and Russia: Alfa Bank  Trump and Russia: Rex Tillerson,  Trump and Russia: Wilbur Ross, Trump and Russia: Betsy DeVos, Trump and Russia: Felix Sater, Trump and Russia: Vitaly Churkin, Trump and Russia: Aras Agalarov, Trump and Russia: Emin Agalarov, Trump and Russia: Guccifer, Trump and Russia: Wikileaks, Trump and Russia: GRU, Trump and Russia: Dmytro Firtash, Trump and Russia: Gazprom, Trump and Russia: Rosneft, Trump and Russia: Bank of Cyprus, Trump and Russia: Sergey Kislyak, Trump and Russia: Sergei Yatsenko, Trump and Russia: SVR, Trump and Russia: RT, Trump and Russia: Sergey Gorkov, Trump and Russia: Andrii Artemenko, Trump and Russia: Vladimir Strzhalkovsky, Trump and Russia: Viktor Vekselberg", "URL": "http://cnn.it/2qiTqu2"},
{ "Title": "Trump White House - CNNPolitics", "Description": "The latest news on the White House.", "Keywords": "politics, Trump White House - CNNPolitics", "URL": "http://edition.cnn.com/specials/politics/trump-white-house"},
{ "Title": "Trump wishes troops a Merry Christmas - CNNPolitics", "Description": "President Donald Trump wished a Merry Christmas to a group of American service members deployed abroad during a teleconference from Mar-a-Lago on Sunday, telling the troops from all five military branches that Americans were asking God to watch over them.", "Keywords": "politics, Trump wishes troops a Merry Christmas - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/24/politics/donald-trump-troops-merry-christmas/index.html"},
{ "Title": "Santorum on Trump: He's not a complex man - CNN Video", "Description": "The CNN panel joins Jake Tapper to discuss President Trump's need to be praised, and whether praise is the best path to influence the president. ", "Keywords": "Jake Tapper, CNN, 2018 Midterm Elections, US Democratic Party, politics, Santorum on Trump: He's not a complex man - CNN Video", "URL": "http://edition.cnn.com/videos/politics/2017/12/21/sotu-panel-12-20.cnn"},
{ "Title": "Santorum: Praise best way to sway Trump - CNN Video", "Description": "Former Sen. Rick Santorum (R-PA) says praise is the best path to influence President Trump.", "Keywords": "Jake Tapper, CNN, 2018 Midterm Elections, US Democratic Party, politics, Santorum: Praise best way to sway Trump - CNN Video", "URL": "http://edition.cnn.com/videos/politics/2017/12/24/santorum-tax-bill-trump-tapper-sot-sotu.cnn"},
{ "Title": "Trump comes to the 'happiest place on Earth' - CNN Video", "Description": "On this week's ”State of the Union Cartoonion”  Donald J. Trump's robot escapes his exhibit at Disney World runs wild around the park. ", "Keywords": "Jake Tapper, Cartoons, Politics, Donald Trump, politics, Trump comes to the 'happiest place on Earth' - CNN Video", "URL": "http://edition.cnn.com/videos/politics/2017/12/21/sotu-cartoon-12-20.cnn"},
{ "Title": "Bush, Obama advisers reflect on year of Trump - CNN Video", "Description": "David Axelrod, former adviser to Barack Obama, and  Mark McKinnon, former adviser to George W. Bush, look back on Donald Trump's first year in office.", "Keywords": "Jake Tapper, CNN, Trump, White House, Tax Bill, GOP, Democrats, politics, Bush, Obama advisers reflect on year of Trump - CNN Video", "URL": "http://edition.cnn.com/videos/politics/2017/12/21/sotu-axe-mckinnon-invt-12-20.cnn"},
{ "Title": "What Trump's tweets taught us in 2017 - CNN Video", "Description": "What's on the president's mind? What time did he wake up this morning? Is he watching cable news? In 2017, when reporters wanted a glimpse inside Trump's head, they turned to Twitter.", "Keywords": "trump, donald trump, twitter, trump tweets, gop, republicans, president trump, white house, tv, What Trump's tweets taught us in 2017 - CNN Video", "URL": "http://edition.cnn.com/videos/tv/2017/12/22/what-trumps-tweets-taught-us-in-2017.cnn"},
{ "Title": "Trump's 2017 victories and missteps - CNN Video", "Description": "Inside Politics delves into the ups and downs of Trump's 2017 including the tax cut win, the strong economy and why he can't seem to shake historically low approval numbers.", "Keywords": "Tax bill, Donald Trump, White House, Politics, Healthcare, CNN, President Trump, john king, maeve reston, michael shear, sahil kapur, congress, gop, republicans, trump presidency, politics, Trump's 2017 victories and missteps - CNN Video", "URL": "http://edition.cnn.com/videos/politics/2017/12/22/inside-politics-a-block.cnn"},
{ "Title": "WH denies Trump said Haitian immigrants 'all have AIDS' - CNNPolitics", "Description": "The White House denied on Saturday a New York Times report that President Donald Trump spoke about immigrants in a dismissive and demeaning fashion during a June meeting with top administration officials.", "Keywords": "politics, WH denies Trump said Haitian immigrants 'all have AIDS' - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/23/politics/donald-trump-oval-office-immigration/index.html"},
{ "Title": "Despite Trump hopes, US Russia relations get chilly - CNNPolitics", "Description": "In the space of a week, the Trump administration has named Russia a ”rival power,” sanctioned a close Putin ally, and decided to give Ukraine anti-tank weapons to help in its fight against Moscow-backed militias. ", "Keywords": "politics, Despite Trump hopes, US Russia relations get chilly - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/24/politics/trump-us-russia-chill/index.html"},
{ "Title": "Trump takes aim at top FBI officials on Twitter - CNNPolitics", "Description": "President Donald Trump criticized two FBI officials Saturday afternoon in a string of tweets following reports of reassignments and retirements within the bureau's top brass. ", "Keywords": "politics, Trump takes aim at top FBI officials on Twitter - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/23/politics/trump-fbi-mccabe-baker-tweets/index.html"},
{ "Title": "Trump lashes out at top leaders of his own FBI - CNN Video", "Description": "President Donald Trump lashes out at FBI Deputy Director Andrew McCabe in a tweetstorm. CNN's Shimon Prokupecz reports. ", "Keywords": "politics, Trump lashes out at top leaders of his own FBI - CNN Video", "URL": "http://edition.cnn.com/videos/politics/2017/12/24/trump-tweets-fbi-deputy-director-prokupecz-nd-lklv.cnn"}
]