[
{ "Title": "Trump signs tax bill before leaving for Mar-a-Lago - CNNPolitics", "Description": "President Donald Trump will sign the Republican tax cut bill Friday morning before departing for his Christmas break in Florida.", "Keywords": "politics, Trump signs tax bill before leaving for Mar-a-Lago - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/22/politics/trump-sign-tax-bill-mar-a-lago/index.html"},
{ "Title": "The fine print of Trump's tax talking points - CNNPolitics", "Description": "For the first time since he took office a little more than 11 months ago, President Trump has signed into law sweeping new legislation -- a wide-ranging tax cut that will fundamentally remake the US tax code.", "Keywords": "politics, The fine print of Trump's tax talking points - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/22/politics/trump-tax-plan-talking-points/index.html"},
{ "Title": "Trump makes holiday visit to Walter Reed - CNNPolitics", "Description": "President Donald Trump was paying a holiday visit to wounded troops receiving medical care at a hospital outside Washington on Thursday", "Keywords": "politics, Trump makes holiday visit to Walter Reed - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/21/politics/trump-walter-reed/index.html"},
{ "Title": "Trump visited his properties over 100 times this year - CNNPolitics", "Description": "President Donald Trump, fresh off of signing his signature tax legislation, is in Florida for a  prolonged visit at Mar-A-Lago", "Keywords": "politics, Trump visited his properties over 100 times this year - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/22/politics/trump-mar-a-lago-golf/index.html"},
{ "Title": "Trump 'fired up' about humanitarian crisis in Yemen - CNNPolitics", "Description": "President Donald Trump has become increasingly concerned about the humanitarian crisis in Yemen, which has been made worse by years of fighting between Houthi rebels and the Saudi-led international coalition, a United Kingdom official tells CNN.", "Keywords": "politics, Trump 'fired up' about humanitarian crisis in Yemen - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/20/politics/trump-yemen-humanitarian-crisis/index.html"},
{ "Title": "Most Americans doubt Trump on Russia probe - CNNPolitics", "Description": "More Americans say they approve of how special counsel Robert Mueller is handling the investigation into Russian interference in the 2016 election than say they disapprove, a new CNN poll conducted by SSRS has found, while most Americans say President Donald Trump's public statements on the probe have not been truthful.", "Keywords": "politics, Most Americans doubt Trump on Russia probe - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/21/politics/trump-mueller-russia-poll/index.html"},
{ "Title": "Did Trump stop the 'war on Christmas'? Some say yes - CNNPolitics", "Description": "Did President Donald Trump live up to his promise to end the "war on Christmas"? Depends on who you ask.", "Keywords": "politics, Did Trump stop the 'war on Christmas'? Some say yes - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/22/politics/donald-trump-war-on-christmas/index.html"},
{ "Title": "Trump is eager for 2018 campaigning, but are Republicans eager for him? - CNNPolitics", "Description": "Donald Trump, keen to fill the halls of Congress with his acolytes while defending his record as President, is already fully involved in his administration's political efforts ahead of the 2018 midterms, senior White House officials tell CNN.", "Keywords": "politics, Trump is eager for 2018 campaigning, but are Republicans eager for him? - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/21/politics/trump-2018-campaigning-republicans/index.html"},
{ "Title": "Trump issues first commutation - CNNPolitics", "Description": "President Donald Trump commuted the sentence of a man eight years into a 27-year term for bank fraud, the White House said Wednesday afternoon.", "Keywords": "politics, Trump issues first commutation - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/20/politics/donald-trump-commutes-sholom-rubashkin/index.html"},
{ "Title": "Trump on Alabama: 'I was right' Moore wouldn't be able to win - CNNPolitics", "Description": "President Donald Trump went back to Twitter Wednesday morning following Alabama's election stunner, claiming that he didn't endorse Republican candidate Roy Moore in the primary election because Trump knew Moore wouldn't be "able to win." ", "Keywords": "politics, Trump on Alabama: 'I was right' Moore wouldn't be able to win - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/13/_politics-zone-injection/trump-tweet-alabama/index.html"},
{ "Title": "Donald Trump tries to minimize stinging defeat in Alabama - CNNPolitics", "Description": "President Donald Trump is waking to a self-inflicted political disaster after Republican Roy Moore crashed to defeat in the Alabama Senate race.", "Keywords": "politics, Donald Trump tries to minimize stinging defeat in Alabama - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/13/politics/donald-trump-senate-race/index.html"},
{ "Title": "USA Today editorial board bashes Trump - CNNPolitics", "Description": "USA Today isn't known for its blistering opinion pieces. Which makes the one the paper's editorial board just published on President Donald Trump all the more savage.", "Keywords": "politics, USA Today editorial board bashes Trump - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/12/politics/usa-today-editorial-analysis/index.html"},
{ "Title": "Trump team push undercut by NY attack facts, critics say - CNNPolitics", "Description": "As the Trump administration presses the notion that recent terrorist attacks justify significant changes in the legal immigration system, critics say the facts of those attacks undercut their own argument. ", "Keywords": "politics, Trump team push undercut by NY attack facts, critics say - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/12/politics/new-york-attacker-domestic-radicalization-trump-administration/index.html"},
{ "Title": "Donald Trump woke up this morning and Alabama is still not his fault - CNNPolitics", "Description": "Less than 12 hours removed from a searing loss in Alabama's Senate race, President Donald Trump woke up Wednesday morning with a simple message: I was right.", "Keywords": "politics, Donald Trump woke up this morning and Alabama is still not his fault - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/13/politics/donald-trump-alabama-tweet-analysis/index.html"},
{ "Title": "Gillibrand on Trump's tweet: It was a 'sexist smear' - CNNPolitics", "Description": "Democratic Sen. Kirsten Gillibrand reiterated her belief that President Donald Trump's tweet on Tuesday about her was a "sexist smear" in an interview Wednesday.", "Keywords": "politics, Gillibrand on Trump's tweet: It was a 'sexist smear' - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/13/politics/kirsten-gillibrand-donald-trump-tweet/index.html"},
{ "Title": "By the numbers: The Trump orbit's contacts with Russians - CNNPolitics", "Description": "Here is a look, by the numbers, at all the known contacts between Trump associates and Russians. From meetings to emails, to text messages and Skype sessions, these lists have been growing throughout the year as more details drip out in the investigations into Russian meddling in the 2016 US elections.", "Keywords": "politics, By the numbers: The Trump orbit's contacts with Russians - CNNPolitics", "URL": "http://edition.cnn.com/2017/11/21/politics/trump-russia-by-the-numbers/index.html"},
{ "Title": "The many paths from Trump to Russia", "Description": "Special Counsel Robert Mueller and committees in both chambers of Congress are investigating Russian meddling in the 2016 election and whether there were any links or coordination between the Trump orbit and the Russian government. Here is a summary of known connections between Trump associates and Russia.", "Keywords": "Trump and Russia: Known ties, Trump and Russia: Known connections, Trump and Russia: Connections, Trump and Russia: Putin, Trump and Russia: Election, Trump and Russia: infographic, Trump Russia Infographic, Trump and Russia: CNN, Trump and Russia: Hacking, Trump Russia Putin, Trump Russia graphic, Trump Russia Paul Manafort, Trump and Russia: Michael Flynn, Trump and Russia: Carter Page, Trump and Russia: Roger Stone, Trump and Russia: Jeff Sessions,  Trump and Russia: JD Gordon, Trump and Russia: Jared Kushner, Trump and Russia: Donald Trump Jr., Trump and Russia: Michael Cohen, Trump and Russia: Erik Prince, Trump and Russia: Alfa Bank  Trump and Russia: Rex Tillerson,  Trump and Russia: Wilbur Ross, Trump and Russia: Betsy DeVos, Trump and Russia: Felix Sater, Trump and Russia: Vitaly Churkin, Trump and Russia: Aras Agalarov, Trump and Russia: Emin Agalarov, Trump and Russia: Guccifer, Trump and Russia: Wikileaks, Trump and Russia: GRU, Trump and Russia: Dmytro Firtash, Trump and Russia: Gazprom, Trump and Russia: Rosneft, Trump and Russia: Bank of Cyprus, Trump and Russia: Sergey Kislyak, Trump and Russia: Sergei Yatsenko, Trump and Russia: SVR, Trump and Russia: RT, Trump and Russia: Sergey Gorkov, Trump and Russia: Andrii Artemenko, Trump and Russia: Vladimir Strzhalkovsky, Trump and Russia: Viktor Vekselberg", "URL": "http://cnn.it/2qiTqu2"},
{ "Title": "Trump White House - CNNPolitics", "Description": "The latest news on the White House.", "Keywords": "politics, Trump White House - CNNPolitics", "URL": "http://edition.cnn.com/specials/politics/trump-white-house"},
{ "Title": "A look at Trump's longtime assistant - CNN Video", "Description": "President Donald Trump's longtime personal assistant, Rhona Graff, was questioned by the House Intelligence Committee as part of the Russia probe.", "Keywords": "politics, A look at Trump's longtime assistant - CNN Video", "URL": "http://edition.cnn.com/videos/politics/2017/12/23/trump-assistant-rhona-graff-russia-probe-kosik-erin-dnt.cnn"},
{ "Title": "El futuro del Partido Republicano después de la reforma fiscal de Trump - CNN Video", "Description": "Trump firmó la reforma fiscal, un proyecto rechazado por 55% de los estadounidenses, y se marchó a Mar-a-Lago a celebrar la Navidad con tan solo un 35% de aprobación de su gestión, el más bajo en la historia de los Estados Unidos. ¿Qué pasará ahora con el Partido Republicano? ¿Han creado la tormenta perfecta al apoyar esta reforma o la maquinaría republicana logrará cambiar la percepción del votante en las elecciones intermedias? Lo analizamos con Roberto Izurieta, director de Proyectos Latinoamericanos en la Universidad George Washington.", "Keywords": "spanish, El futuro del Partido Republicano después de la reforma fiscal de Trump - CNN Video", "URL": "http://edition.cnn.com/videos/spanish/2017/12/23/cnnee-dinero-izurieta-entrevista-122217.cnn"},
{ "Title": "Trumpy Bear: Real or spoof? - CNN Video", "Description": "Trump plus bear equals Trumpy Bear ... a bizarro gift of the holiday season. CNN's Jeanne Moos cuddles one.", "Keywords": "us, Trumpy Bear: Real or spoof? - CNN Video", "URL": "http://edition.cnn.com/videos/us/2017/12/23/donald-trump-limited-edition-teddy-bear-moos.cnn"},
{ "Title": "Antes de celebrar la Navidad en la Florida, Trump firmó la reforma fiscal - CNN Video", "Description": "El presidente Donald Trump estampó su firma y así promulgó la ley de reforma fiscal antes de emprender viaje a la Florida donde pasará las fiestas navideñas. ", "Keywords": "spanish, Antes de celebrar la Navidad en la Florida, Trump firmó la reforma fiscal - CNN Video", "URL": "http://edition.cnn.com/videos/spanish/2017/12/23/cnnee-panorama-reforma-fiscal-trump.cnn"},
{ "Title": "2017 was Trumpism's last gasp (opinion) - CNN", "Description": "As painful as it has been to watch Trump and his supporters rally, theirs is a dying world view, says Mel Robbins.Theirs is not the reality of America.", "Keywords": "opinions, 2017 was Trumpism's last gasp (opinion) - CNN", "URL": "http://edition.cnn.com/2017/12/22/opinions/2017-was-trumpisms-last-gasp-robbins/index.html"},
{ "Title": "Trump wanted a news conference but aides convinced him otherwise - CNNPolitics", "Description": "President Donald Trump told aides he was eager to take questions Friday and hold a news conference to tout his accomplishments before leaving for Mar-a-Lago, but some advisers argued against it.", "Keywords": "politics, Trump wanted a news conference but aides convinced him otherwise - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/22/politics/donald-trump-no-news-conference/index.html"},
{ "Title": "North Korea insults Trump after sanctions - CNN Video", "Description": "The UN Security Council unanimously adopted a new set of draconian US-drafted sanctions on North Korea that will further strangle its energy supplies and tighten restrictions on smuggling and the use of North Korean workers overseas.", "Keywords": "world, North Korea insults Trump after sanctions - CNN Video", "URL": "http://edition.cnn.com/videos/world/2017/12/22/north-korea-un-national-security-strategy-trump-insult-todd-dnt-sitroom.cnn"},
{ "Title": "Report: Hundreds of EPA employees leave under Trump - CNNPolitics", "Description": "Hundreds of Environmental Protection Agency employees have exited their posts at the agency over the course of President Donald Trump's first year in office, a report by the New York Times and ProPublica said Friday. ", "Keywords": "politics, Report: Hundreds of EPA employees leave under Trump - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/22/politics/epa-trump-administration-new-york-times/index.html"},
{ "Title": "Ex diplomat slams Trump and Tillerson for putting Americans at risk - CNNPolitics", "Description": "An American diplomat who resigned in frustration last week has told CNN that she believes the Trump administration is putting American citizens abroad at risk by sidelining the State Department.", "Keywords": "politics, Ex diplomat slams Trump and Tillerson for putting Americans at risk - CNNPolitics", "URL": "http://edition.cnn.com/2017/12/14/politics/elizabeth-shackelford-amanpour-state-department/index.html"},
{ "Title": "Officials: Trump wanted news conference - CNN Video", "Description": "According to White House officials, President Trump wanted to hold an end-of-the-year news conference before leaving for the holidays, but top aides said no.", "Keywords": "politics, Officials: Trump wanted news conference - CNN Video", "URL": "http://edition.cnn.com/videos/politics/2017/12/22/trump-wanted-end-of-year-press-conference-lead.cnn"},

]