[
{ "Title": "", "Description": "“The Fake News refuses to talk about how Big and how Strong our BASE is. They show Fake Polls just like they report Fake News. Despite only negative reporting, we are doing well - nobody is going to beat us. MAKE AMERICA GREAT AGAIN!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944927689638662145"},
{ "Title": "", "Description": "“@realDonaldTrump Thank you President TRUMP!!”", "Keywords": "", "URL": "https://twitter.com/shawgerald4/status/944700607624970240"},
{ "Title": "", "Description": "“.@FoxNews-FBI’s Andrew McCabe, “in addition to his wife getting all of this money from M (Clinton Puppet), he was using, allegedly, his FBI Official Email Account to promote her campaign. You obviously cannot do this. These were the people who were investigating Hillary Clinton.””", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944906847970119680"},
{ "Title": "", "Description": "“Remember, the Republicans are 5-0 in Congressional races this year. In Senate, I said Roy M would lose in Alabama and supported Big Luther Strange - and Roy lost. Virginia candidate was not a “Trumper,” and he lost.  Good Republican candidates will win BIG!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944703626454487042"},
{ "Title": "", "Description": "“The Stock Market is setting record after record and unemployment is at a 17 year low. So many things accomplished by the Trump Administration, perhaps more than any other President in first year. Sadly, will never be reported correctly by the Fake News Media!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944700332881440769"},
{ "Title": "", "Description": "“Wow, “FBI lawyer James Baker reassigned,” according to @FoxNews.”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944667102312566784"},
{ "Title": "", "Description": "“FBI Deputy Director Andrew McCabe is racing the clock to retire with full benefits. 90 days to go?!!!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944666448185692166"},
{ "Title": "", "Description": "“How can FBI Deputy Director Andrew McCabe, the man in charge, along with leakin’ James Comey, of the Phony Hillary Clinton investigation (including her 33,000 illegally deleted emails) be given $700,000 for wife’s campaign by Clinton Puppets during investigation?”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944665687292817415"},
{ "Title": "", "Description": "“#JournalismIsDead  https://t.co/xZaJD5ADb7”", "Keywords": "", "URL": "https://twitter.com/EricTrump/status/944550147463303169"},
{ "Title": "", "Description": "“Remember, the most hated part of ObamaCare is the Individual Mandate, which is being terminated under our just signed Tax Cut Bill.”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944329684032081921"},
{ "Title": "", "Description": "“Today, it was my great honor to sign the largest TAX CUTS and reform in the history of our country. Full remarks: https://t.co/kMxoxEB68G https://t.co/OeAoA0sLfx”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944308491887316992"},
{ "Title": "", "Description": "“The United Nations Security Council just voted 15-0 in favor of additional Sanctions on North Korea. The World wants Peace, not Death!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944308373373308929"},
{ "Title": "", "Description": "“Congressman Ron DeSantis is a brilliant young leader, Yale and then Harvard Law, who would make a GREAT Governor of Florida. He loves our Country and is a true FIGHTER!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944276471614509057"},
{ "Title": "", "Description": "“95% of Americans will pay less or, at worst, the same amount of taxes (mostly far less). The Dems only want to raise your taxes!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944247868126318593"},
{ "Title": "", "Description": "“Will be signing the biggest ever Tax Cut and Reform Bill in 30 minutes in Oval Office. Will also be signing a much needed 4 billion dollar missile defense bill.”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944222979147337728"},
{ "Title": "", "Description": "“With all my Administration has done on Legislative Approvals (broke Harry Truman’s Record), Regulation Cutting, Judicial Appointments, Building Military, VA, TAX CUTS &amp; REFORM, Record Economy/Stock Market and so much more, I am sure great credit will be given by mainstream news?”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944222157218942978"},
{ "Title": "", "Description": "““The President has accomplished some absolutely historic things during this past year.” Thank you Charlie Kirk of Turning Points USA. Sadly, the Fake Mainstream Media will NEVER talk about our accomplishments in their end of year reviews. We are compiling a long &amp; beautiful list.”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944210183089254400"},
{ "Title": "", "Description": "“At some point, and for the good of the country, I predict we will start working with the Democrats in a Bipartisan fashion. Infrastructure would be a perfect place to start. After having foolishly spent $7 trillion in the Middle East, it is time to start rebuilding our country!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944192071535153152"},
{ "Title": "", "Description": "“So true! https://t.co/1c8hu6O5t9”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944188445748015105"},
{ "Title": "", "Description": "“Our big and very popular Tax Cut and Reform Bill has taken on an unexpected new source of “love” - that is big companies and corporations showering their workers with bonuses. This is a phenomenon that nobody even thought of, and now it is the rage. Merry Christmas!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944187730564714497"}
]