[
{ "Title": "", "Description": "“Remember, the most hated part of ObamaCare is the Individual Mandate, which is being terminated under our just signed Tax Cut Bill.”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944329684032081921"},
{ "Title": "", "Description": "“Today, it was my great honor to sign the largest TAX CUTS and reform in the history of our country. Full remarks: https://t.co/kMxoxEB68G https://t.co/OeAoA0sLfx”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944308491887316992"},
{ "Title": "", "Description": "“The United Nations Security Council just voted 15-0 in favor of additional Sanctions on North Korea. The World wants Peace, not Death!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944308373373308929"},
{ "Title": "", "Description": "“Congressman Ron DeSantis is a brilliant young leader, Yale and then Harvard Law, who would make a GREAT Governor of Florida. He loves our Country and is a true FIGHTER!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944276471614509057"},
{ "Title": "", "Description": "“95% of Americans will pay less or, at worst, the same amount of taxes (mostly far less). The Dems only want to raise your taxes!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944247868126318593"},
{ "Title": "", "Description": "“Will be signing the biggest ever Tax Cut and Reform Bill in 30 minutes in Oval Office. Will also be signing a much needed 4 billion dollar missile defense bill.”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944222979147337728"},
{ "Title": "", "Description": "“With all my Administration has done on Legislative Approvals (broke Harry Truman’s Record), Regulation Cutting, Judicial Appointments, Building Military, VA, TAX CUTS &amp; REFORM, Record Economy/Stock Market and so much more, I am sure great credit will be given by mainstream news?”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944222157218942978"},
{ "Title": "", "Description": "““The President has accomplished some absolutely historic things during this past year.” Thank you Charlie Kirk of Turning Points USA. Sadly, the Fake Mainstream Media will NEVER talk about our accomplishments in their end of year reviews. We are compiling a long &amp; beautiful list.”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944210183089254400"},
{ "Title": "", "Description": "“At some point, and for the good of the country, I predict we will start working with the Democrats in a Bipartisan fashion. Infrastructure would be a perfect place to start. After having foolishly spent $7 trillion in the Middle East, it is time to start rebuilding our country!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944192071535153152"},
{ "Title": "", "Description": "“So true! https://t.co/1c8hu6O5t9”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944188445748015105"},
{ "Title": "", "Description": "“Our big and very popular Tax Cut and Reform Bill has taken on an unexpected new source of “love” - that is big companies and corporations showering their workers with bonuses. This is a phenomenon that nobody even thought of, and now it is the rage. Merry Christmas!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/944187730564714497"},
{ "Title": "", "Description": "“THANK YOU to everyone who joined me at the @WhiteHouse yesterday. Together, we are MAKING AMERICA GREAT AGAIN! https://t.co/9HgcBKDSxo https://t.co/dTMU8OwmWB”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/943908041803657216"},
{ "Title": "", "Description": "“House Democrats want a SHUTDOWN for the holidays in order to distract from the very popular, just passed, Tax Cuts. House Republicans, don’t let this happen. Pass the C.R. TODAY and keep our Government OPEN!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/943856675294982145"},
{ "Title": "", "Description": "“Home Sales hit BEST numbers in 10 years! MAKE AMERICA GREAT AGAIN”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/943842608631238656"},
{ "Title": "", "Description": "“Was @foxandfriends just named the most influential show in news? You deserve it - three great people! The many Fake News Hate Shows should study your formula for success!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/943824695144697857"},
{ "Title": "", "Description": "“The Massive Tax Cuts, which the Fake News Media is desperate to write badly about so as to please their Democrat bosses, will soon be kicking in and will speak for themselves. Companies are already making big payments to workers. Dems want to raise taxes, hate these big Cuts!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/943819430735372289"},
{ "Title": "", "Description": "“WE ARE MAKING AMERICA GREAT AGAIN! https://t.co/HY353gXV0R”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/943598090069536768"},
{ "Title": "", "Description": "“We are delivering HISTORIC TAX RELIEF for the American people!#TaxCutsandJobsAct https://t.co/lLgATrCh5o”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/943543958730309633"},
{ "Title": "", "Description": "“Together, we are MAKING AMERICA GREAT AGAIN! https://t.co/47k9i4p3J2”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/943534069287194626"},
{ "Title": "", "Description": "“I would like to congratulate @SenateMajLdr on having done a fantastic job both strategically &amp; politically on the passing in the Senate of the MASSIVE TAX CUT &amp; Reform Bill. I could have not asked for a better or more talented partner. Our team will go onto many more VICTORIES!”", "Keywords": "", "URL": "https://twitter.com/realDonaldTrump/status/943521141062238208"},

]